Duhanfeng/SourceLib_V4/Platform/stm32f10x/hw_rcc.c
      #if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL) || defined  (STM32F10X_HD_VL)
      case TIM6_BASE  : RCC->APB1ENR &= ~RCC_APB1ENR_TIM6EN;   break;
      case TIM7_BASE  : RCC->APB1ENR &= ~RCC_APB1ENR_TIM7EN;   break;
      case DAC_BASE   : RCC->APB1ENR &= ~RCC_APB1ENR_DACEN;    break;
      case CEC_BASE   : RCC->APB1ENR &= ~RCC_APB1ENR_CECEN;    break;
      #endif

      #ifdef STM32F10X_HD_VL
      case TIM5_BASE  : RCC->APB1ENR &= ~RCC_APB1ENR_TIM5EN;   break;
      case TIM12_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_TIM12EN;  break;
      case TIM13_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_TIM13EN;  break;
      case TIM14_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_TIM14EN;  break;
      case SPI3_BASE  : RCC->APB1ENR &= ~RCC_APB1ENR_SPI3EN;   break;
      case UART4_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_UART4EN;  break;
      case UART5_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_UART5EN;  break;
      #endif /* STM32F10X_HD_VL */

      #ifdef STM32F10X_CL
      case CAN2_BASE  : RCC->APB1ENR &= ~RCC_APB1ENR_CAN2EN;   break;
      #endif /* STM32F10X_CL */

      #ifdef STM32F10X_XL
      case TIM12_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_TIM12EN;  break;
      case TIM13_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_TIM13EN;  break;
      case TIM14_BASE : RCC->APB1ENR &= ~RCC_APB1ENR_TIM14EN;  break;
      #endif /* STM32F10X_XL */
      
      default: SL_ASSERT(0); break;
    }
  }
    
}



/**
  * @brief  复位时钟
  * @param  PERI_ADDR 外设地址
  * @param  isEnable 1-进入复位模式 0-取消复位模式
  * @retval None
  * @note   当进入复位模式下,寄存器恢复默认配置,但是此时对寄存器的操作无效,必须要退出复位模式能对其寄存器进行配置
  */
void RCC_ResetClock(void *PERI_ADDR, uint8_t isEnable)
{
  SL_ASSERT(PERI_ADDR);
  
  //开时钟
  if (isEnable)
  {
    switch ((uint32_t) PERI_ADDR)
    {
      /******************  Bit definition for RCC_APB2RSTR register  *****************/
      case AFIO_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_AFIORST;   break;
      case GPIOA_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPARST;   break;
      case GPIOB_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPBRST;   break;
      case GPIOC_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPCRST;   break;
      case GPIOD_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPDRST;   break;
      case ADC1_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_ADC1RST;   break;
      
      #if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD_VL)
      case ADC2_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_ADC2RST;   break;
      #endif
      
      case TIM1_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_TIM1RST;   break;
      case SPI1_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_SPI1RST;   break;
      case USART1_BASE: RCC->APB2RSTR |= RCC_APB2RSTR_USART1RST; break;
      
      #if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
      case TIM15_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_TIM15RST;  break;
      case TIM16_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_TIM16RST;  break;
      case TIM17_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_TIM17RST;  break;
      #endif
      
      #if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
      case GPIOE_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPERST;   break;
      #endif /* STM32F10X_LD && STM32F10X_LD_VL */
      
      #if defined (STM32F10X_HD) || defined (STM32F10X_XL)
      case GPIOF_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPFRST;   break;
      case GPIOG_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPGRST;   break;
      case TIM8_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_TIM8RST;   break;
      case ADC3_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_ADC3RST;   break;
      #endif

      #if defined (STM32F10X_HD_VL)
      case GPIOF_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPFRST;   break;
      case GPIOG_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_IOPGRST;   break;
      #endif
      
      #ifdef STM32F10X_XL
      case TIM9_BASE  : RCC->APB2RSTR |= RCC_APB2RSTR_TIM9RST;   break;
      case TIM10_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_TIM10RST;  break;
      case TIM11_BASE : RCC->APB2RSTR |= RCC_APB2RSTR_TIM11RST;  break;
      #endif
      
      /*****************  Bit definition for RCC_APB1RSTR register  ******************/
      case TIM2_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM2RST;   break;
      case TIM3_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM3RST;   break;
      case WWDG_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_WWDGRST;   break;
      case USART2_BASE: RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST; break;
      case I2C1_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST; break;
      
      #if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD_VL)
      case CAN1_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_CAN1RST;   break;
      #endif
          
      case BKP_BASE   : RCC->APB1RSTR |= RCC_APB1RSTR_BKPRST;    break;
      case PWR_BASE   : RCC->APB1RSTR |= RCC_APB1RSTR_PWRRST;    break;
      
      #if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
      case TIM4_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM4RST;   break;
      case SPI2_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_SPI2RST;   break;
      case USART3_BASE: RCC->APB1RSTR |= RCC_APB1RSTR_USART3RST; break;
      case I2C2_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_I2C2RST;   break;
      #endif /* STM32F10X_LD && STM32F10X_LD_VL */

      #if defined (STM32F10X_HD) || defined (STM32F10X_MD) || defined  (STM32F10X_LD)
      #endif
      
      #if defined (STM32F10X_HD) || defined  (STM32F10X_CL)
      case TIM5_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM5RST;   break;
      case TIM6_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM6RST;   break;
      case TIM7_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM7RST;   break;
      case SPI3_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_SPI3RST;   break;
      case UART4_BASE : RCC->APB1RSTR |= RCC_APB1RSTR_UART4RST;  break;
      case UART5_BASE : RCC->APB1RSTR |= RCC_APB1RSTR_UART5RST;  break;
      case DAC_BASE   : RCC->APB1RSTR |= RCC_APB1RSTR_DACRST;    break;
      #endif
      
      #if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL) || defined  (STM32F10X_HD_VL)
      case TIM6_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM6RST;   break;
      case TIM7_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM7RST;   break;
      case DAC_BASE   : RCC->APB1RSTR |= RCC_APB1RSTR_DACRST;    break;
      case CEC_BASE   : RCC->APB1RSTR |= RCC_APB1RSTR_CECRST;    break;
      #endif

      #ifdef STM32F10X_HD_VL
      case TIM5_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_TIM5RST;   break;
      case TIM12_BASE : RCC->APB1RSTR |= RCC_APB1RSTR_TIM12RST;  break;
      case TIM13_BASE : RCC->APB1RSTR |= RCC_APB1RSTR_TIM13RST;  break;
      case TIM14_BASE : RCC->APB1RSTR |= RCC_APB1RSTR_TIM14RST;  break;
      case SPI3_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_SPI3RST;   break;
      case UART4_BASE : RCC->APB1RSTR |= RCC_APB1RSTR_UART4RST;  break;
      case UART5_BASE : RCC->APB1RSTR |= RCC_APB1RSTR_UART5RST;  break;
      #endif /* STM32F10X_HD_VL */

      #ifdef STM32F10X_CL
      case CAN2_BASE  : RCC->APB1RSTR |= RCC_APB1RSTR_CAN2RST;   break;
      #endif /* STM32F10X_CL */

